data_analysis/repo/gpu_log/benchmark_20250630_085736_mDeepSeek-R1-Distill-Llama-70B_np300_mc40_in1024_out1024.log
INFO 06-30 08:57:42 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=40, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=300, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=1024', 'output_len=1024', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 40
100%|██████████| 300/300 [01:33<00:00,  3.22it/s]
============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  93.29     
Total input tokens:                      306900    
Total generated tokens:                  224708    
Request throughput (req/s):              3.22      
Output token throughput (tok/s):         2408.66   
Total Token throughput (tok/s):          5698.35   
---------------Time to First Token----------------
Mean TTFT (ms):                          125.99    
Median TTFT (ms):                        57.40     
P99 TTFT (ms):                           514.00    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.36     
Median TPOT (ms):                        15.50     
P99 TPOT (ms):                           17.55     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.31     
Median ITL (ms):                         13.91     
P99 ITL (ms):                            42.76     
==================================================